{
    "combineProfiles": [
        {
            "id": "b9798b6d-0ff0-4e38-a9cb-556173e399a6",
            "year": 2025,
            "person": {
                "id": "3200534d-4901-5660-6d2f-ae20575b8580",
                "displayName": "Aaron Smith",
                "esbId": "SMI015660",
                "firstName": "Aaron",
                "lastName": "Smith",
                "hometown": "Manning, SC",
                "collegeNames": [
                    "South Carolina State"
                ]
            },
            "armLength": null,
            "athleticismScore": null,
            "benchPress": null,
            "broadJump": null,
            "bio": null,
            "collegeClass": "Senior",
            "draftGrade": null,
            "draftProjection": "Priority free agent",
            "fortyYardDash": null,
            "grade": 5.64,
            "handSize": null,
            "headshot": "https://static.www.nfl.com/image/private/{formatInstructions}/league/god-draft-headshots/2025/3200534d-4901-5660-6d2f-ae20575b8580",
            "height": 72.0,
            "nflComparison": null,
            "overview": "<p>Inside linebacker with solid production and an average athletic profile. Smith looks faster on tape than his timed speed would suggest. He can disrupt the action with called blitzes and shots downhill. However, his instincts and play recognition are lacking. Smith plays with a competitive demeanor, but he needs to ratchet up his physicality as a tackler. He’s capable on special teams, but he might not stand out enough to give himself much of a chance to make a roster.</p>",
            "productionScore": null,
            "profileAuthor": "Lance Zierlein",
            "proFortyYardDash": null,
            "sixtyYardShuttle": null,
            "sizeScore": null,
            "sourcesTellUs": null,
            "strengths": "<ul>\n<li>Athletic testing showed quality explosiveness in his lower half.</li>\n<li>Slink in his upper body allows him to slip around blocks.</li>\n<li>Scrapes with his eyes and pads square to the action.</li>\n<li>Created duress in the pocket as a pass rusher.</li>\n<li>Has proven himself a productive tackler on kick coverage units.</li>\n</ul>",
            "tenYardSplit": null,
            "threeConeDrill": null,
            "twentyYardShuttle": null,
            "weaknesses": "<ul>\n<li>Below-average change of direction quickness.</li>\n<li>Needs to work on block take-ons to leverage his run fits.</li>\n<li>Doesn’t display natural instincts to flow quickly with play design.</li>\n<li>More of a drag-down tackler than a tone-setting striker.</li>\n<li>Will need to prove he has the play speed for faster competition.</li>\n</ul>",
            "combineAttendance": false,
            "position": "LB",
            "positionGroup": "LB",
            "verticalJump": null,
            "weight": 226.0
        },
        {
            "id": "3ea425e1-f7de-44e4-aaea-3c643fd2dd2b",
            "year": 2025,
            "person": {
                "id": "32004341-5260-6063-f7d8-00bb3d6b1cd4",
                "displayName": "Abdul Carter",
                "esbId": "CAR606063",
                "firstName": "Abdul",
                "lastName": "Carter",
                "hometown": "Philadelphia, PA",
                "collegeNames": [
                    "Penn State"
                ]
            },
            "armLength": null,
            "athleticismScore": 83.03,
            "benchPress": null,
            "broadJump": null,
            "bio": "<ul><li><strong>2022:</strong> Freshman All-American. Third-team All-Big Ten. Finalist for the Shaun Alexander Freshman of the Year Award. Led team with 6.5 sacks. Played in all 13 games with 6 starts (56 tackles, 10.5 TFLs, 4 PBUs).</li><li><strong>2023:</strong> First-team All-Big Ten. Started all 13 games (48 tackles, 5.5 TFLs with 4.5 sacks, INT, 5 PBUs, FF).</li><li><strong>2024: </strong>First-team Associated Press All-American. Big Ten Defensive Player of the Year, DL of the Year. First-team All-Big Ten. Finalist for the Bednarik Award (nation's top defender), Lombardi Award (top OL/DL), Ted Hendricks Award (nation's top DE). Led the FBS with 23.5 TFLs, ranked seventh with 12 sacks. Started all 16 games (68 tackles, 4 PBUs, 2 FFs). Switched from off-ball LB to DE after the departure of Chop Robinson and Adisa Isaac to the NFL.</li></ul>\n<p><em>-- by Chad Reuter</em></p>",
            "collegeClass": "Junior",
            "draftGrade": 90.49,
            "draftProjection": "Round 1",
            "fortyYardDash": null,
            "grade": 7.0,
            "handSize": null,
            "headshot": "https://static.www.nfl.com/image/private/{formatInstructions}/league/god-prospect-headshots/2023/32004341-5260-6063-f7d8-00bb3d6b1cd4",
            "height": 75.0,
            "nflComparison": null,
            "overview": "<p>Carter has the urgency and athletic talent to bombard the stat sheet. He’s always first out and first into contact after the snap but can dart into gaps or around blocks as a penetrator. He’s willing to scrap at the point of attack; additional time in the weight room might be in order for his move up in class. Carter rushes with a rabid, all-game intensity that’s hard for opponents to match. He explodes out of the blocks and can force tackles to abandon their technique to go catch him. He can bend and flatten at the top of the rush or hit a game-breaking spin counter inside. He’s good with his hands but needs to keep working in that area to prevent long punchers from knocking him off-course. Carter’s explosiveness, hunger and body control should have him on track to become a highly productive 3-4 rush linebacker with Pro Bowl talent.</p>",
            "productionScore": 94.86,
            "profileAuthor": "Lance Zierlein",
            "proFortyYardDash": null,
            "sixtyYardShuttle": null,
            "sizeScore": null,
            "sourcesTellUs": null,
            "strengths": "<ul>\n<li>Strikes first to gain early advantage at point of attack.</li>\n<li>Too sudden to be stopped from B-gap penetration.</li>\n<li>Slips and parries blocks with footwork and hand swipes.</li>\n<li>Stride length and speed allow for expanded range as playmaker.</li>\n<li>Rush talent to spin the sack counter and alter protection schemes.</li>\n<li>No false steps or wasted motion in his rush get-off.</li>\n<li>Instinctive feel for passing tackle’s edge with dip or hand work</li>\n<li>Agility for tight cornering and sharp change of direction.</li>\n<li>Wicked inside spin gives tackles the blues.</li>\n<li>Closing burst and athleticism make him hard to shake for quarterbacks.</li>\n</ul>",
            "tenYardSplit": null,
            "threeConeDrill": null,
            "twentyYardShuttle": null,
            "weaknesses": "<ul>\n<li>Average size and extended power at point of attack.</li>\n<li>Can be engulfed and neutralized by strength and length.</li>\n<li>Comes in hot, creating smaller margins for error as tackler.</li>\n<li>Displays some ankle tightness in his upfield rush.</li>\n<li>Needs to keep schooling up his hands and rush plan.</li>\n</ul>",
            "combineAttendance": true,
            "position": "EDGE",
            "positionGroup": "DL",
            "verticalJump": null,
            "weight": 250.0
        },
        {
            "id": "9cb89722-1dc5-4167-9c70-cdee5c487b00",
            "year": 2025,
            "person": {
                "id": "32005745-5309-7994-5f3c-8575c560c832",
                "displayName": "Addison West",
                "esbId": "WES097994",
                "firstName": "Addison",
                "lastName": "West",
                "hometown": "Cary, IL",
                "collegeNames": [
                    "Western Michigan"
                ]
            },
            "armLength": null,
            "athleticismScore": null,
            "benchPress": null,
            "broadJump": null,
            "bio": null,
            "collegeClass": "Senior",
            "draftGrade": null,
            "draftProjection": "Round 7/PFA",
            "fortyYardDash": null,
            "grade": 5.84,
            "handSize": null,
            "headshot": "https://static.www.nfl.com/image/private/{formatInstructions}/league/god-draft-headshots/2025/32005745-5309-7994-5f3c-8575c560c832",
            "height": 74.0,
            "nflComparison": null,
            "overview": "<p>West plays with consistent control and confidence. While he has lined up at all three positions along the interior, he projects as a center who has the flexibility to play guard in a pinch. He has the strength to stay connected to bigger bodies but lacks the size and length to become a consistent block finisher in battles against defenders with NFL-caliber size. He’s been rock steady in pass protection, but he wasn’t often tested by long-limbed athletes when singled up. West’s play strength, consistency and scheme-independence bolster his chances of being drafted on Day 3.</p>",
            "productionScore": null,
            "profileAuthor": "Lance Zierlein",
            "proFortyYardDash": null,
            "sixtyYardShuttle": null,
            "sizeScore": null,
            "sourcesTellUs": null,
            "strengths": "<ul>\n<li>Has played all three interior line positions.</li>\n<li>Testing results were similar to those of some of the top interior O-linemen at the NFL Scouting Combine.</li>\n<li>Initial quickness for reach blocks and can climb to cut off linebackers.</li>\n<li>Good firmness into first contact with neutralizing core strength.</li>\n<li>Possesses the anchor to dull a bull rush early on.</li>\n<li>Displays good recognition of lurking twists and delayed blitzes.</li>\n</ul>",
            "tenYardSplit": null,
            "threeConeDrill": null,
            "twentyYardShuttle": null,
            "weaknesses": "<ul>\n<li>Arm length could be a concern at the pro level.</li>\n<li>Will have occasional issues with hands and/or base becoming too wide.</li>\n<li>Needs to maintain pad level when searching for targets in space.</li>\n<li>Room for improvement as a block finisher in the run game.</li>\n<li>Needs to keep weight back to prevent being countered by long-armed rushers.</li>\n</ul>",
            "combineAttendance": false,
            "position": "C",
            "positionGroup": "OL",
            "verticalJump": null,
            "weight": 300.0
        },
        {
            "id": "51306eb2-972e-4097-af0b-f24a33d7f3a4",
            "year": 2025,
            "person": {
                "id": "32004855-4e81-9818-c2f4-9a6d27326ba5",
                "displayName": "Adin Huntington",
                "esbId": "HUN819818",
                "firstName": "Adin",
                "lastName": "Huntington",
                "hometown": "Stafford, VA",
                "collegeNames": [
                    "Tulane",
                    "Louisiana-Monroe",
                    "Kent State"
                ]
            },
            "armLength": null,
            "athleticismScore": null,
            "benchPress": null,
            "broadJump": null,
            "bio": null,
            "collegeClass": "Senior",
            "draftGrade": null,
            "draftProjection": "Priority free agent",
            "fortyYardDash": null,
            "grade": 5.68,
            "handSize": null,
            "headshot": "https://static.www.nfl.com/image/private/{formatInstructions}/league/god-draft-headshots/2025/32004855-4e81-9818-c2f4-9a6d27326ba5",
            "height": 73.0,
            "nflComparison": null,
            "overview": "<p>Huntington’s impressive explosiveness makes him an intriguing prospect. He’s a true “tweener” who lacks the length teams look for on the edge and the mass needed to play inside. He can be knocked around by big bodies but is tough to deal with when he gets a quick upper hand in a gap or on a blocker’s edge. He might need to add weight and ply his trade as a one-gapping 3-technique, but his exceptional athletic testing could earn him a role as a sub-package rusher with special-teams value.</p>",
            "productionScore": null,
            "profileAuthor": "Lance Zierlein",
            "proFortyYardDash": null,
            "sixtyYardShuttle": null,
            "sizeScore": null,
            "sourcesTellUs": null,
            "strengths": "<ul>\n<li>Jaw-dropping athletic testing at his pro day.</li>\n<li>Explosive upper-body strength with violent hands.</li>\n<li>Possesses base strength to play into gaps and disrupt.</li>\n<li>Exceptional closing burst rockets him to make the play.</li>\n<li>Strong hands prevent slippage as a tackle finisher.</li>\n</ul>",
            "tenYardSplit": null,
            "threeConeDrill": null,
            "twentyYardShuttle": null,
            "weaknesses": "<ul>\n<li>Hip tightness causes his play to become linear.</li>\n<li>Gets knocked around by big bodies when playing with a hand down.</li>\n<li>Slow to peel himself off of sustain blocks as a run defender.</li>\n<li>Lack of length shows up when punch reaches him first as a rusher.</li>\n</ul>",
            "combineAttendance": false,
            "position": "EDGE",
            "positionGroup": "DL",
            "verticalJump": null,
            "weight": 281.0
        },
        {
            "id": "fa2e7b56-fdb6-4e43-bf3b-efea2872df66",
            "year": 2025,
            "person": {
                "id": "32005045-4516-0116-455d-0fa56ed36d0d",
                "displayName": "Aeneas Peebles",
                "esbId": "PEE160116",
                "firstName": "Aeneas",
                "lastName": "Peebles",
                "hometown": "Raleigh, NC",
                "collegeNames": [
                    "Virginia Tech",
                    "Duke"
                ]
            },
            "armLength": 31.375,
            "athleticismScore": 68.83,
            "benchPress": null,
            "broadJump": {
                "designation": "OFFICIAL",
                "inches": 109
            },
            "bio": "<ul><li><strong>2020 (Duke):</strong> Played in 10 games as a reserve (3 tackles). Enrolled in January.</li><li><strong>2021 (Duke):</strong> Played in all 12 games with 2 starts (26 tackles, 3 TFLs with 2 sacks).&nbsp;</li><li><strong>2022 (Duke):</strong> Played in all 13 games as a reserve (15 tackles, 2 TFLs with 1.5 sacks, PBU, FF).</li><li><strong>2023 (Duke): </strong>Third-team All-ACC. Led team with 9.5 TFLs. Tied for the team lead with 5 sacks. Played in all 13 games with 1 start (43 tackles, 2 PBUs, FF). Entered the transfer portal after the regular season but still played in Duke’s Birmingham Bowl win over Troy.</li><li><strong>2024:</strong> Third-team Associated Press All-American. First-team All-ACC. Started all 12 games (31 tackles, 6.5 TFLs with 3 sacks, 3 PBUs).</li><li><strong>Miscellaneous:</strong> Father, William, was an All-American DL at Appalachian State and played in the Arena League. Mother, Gia, was an All-Big West softball player at Cal State-Long Beach. Grandfather, Doug Wilkerson, was an OL/DL at North Carolina Central and was drafted 14th overall by the Houston Oilers in 1970 (3-time Pro Bowler).&nbsp;</li></ul>\n<p><em>-- by Chad Reuter</em></p>",
            "collegeClass": "Senior",
            "draftGrade": 66.22,
            "draftProjection": "Rounds 5-6",
            "fortyYardDash": {
                "designation": "OFFICIAL",
                "seconds": 4.94
            },
            "grade": 6.14,
            "handSize": 9.625,
            "headshot": "https://static.www.nfl.com/image/private/{formatInstructions}/league/god-prospect-headshots/2023/32005045-4516-0116-455d-0fa56ed36d0d",
            "height": 72.5,
            "nflComparison": "Darius Philon",
            "overview": "<p>Even-front defensive tackle who lacks measurables but makes up for it with an off-the-charts work rate. Peebles plays like a boxer who constantly comes forward and keeps the pressure on his opponent. He doesn’t have the length to stack and secure gaps as a read-and-react defender, but he can play in the gaps and up the field. He’ll fight hard, but he has no real chance against NFL double teams. However, he consistently battles his way off single blocks and toward the ball. He has an eclectic rush package fueled by motor, power and elusiveness that could translate. He has a decent chance of outplaying his draft slotting if teams get too hung up on his measurables and fail to trust their eyes.</p>",
            "productionScore": 66.38,
            "profileAuthor": "Lance Zierlein",
            "proFortyYardDash": null,
            "sixtyYardShuttle": null,
            "sizeScore": null,
            "sourcesTellUs": null,
            "strengths": "<ul>\n<li>Adequate first-step quickness with good pad level.</li>\n<li>Great pound-for-pound strength with above-average contact balance.</li>\n<li>Plays with eyes, hands and feet to make plays between the tackles.</li>\n<li>Chalked up above-average pressure rate for an interior rusher.</li>\n<li>Relentless effort brings sacks with secondary rush.</li>\n<li>Do not sleep on his silky smooth spin counter.</li>\n</ul>",
            "tenYardSplit": {
                "designation": "UNOFFICIAL",
                "seconds": 1.74
            },
            "threeConeDrill": null,
            "twentyYardShuttle": {
                "designation": "OFFICIAL",
                "seconds": 4.7
            },
            "weaknesses": "<ul>\n<li>Plugger body type, lacking NFL mass as an inside prospect.</li>\n<li>Short arms are unable to punch, press and lock out blocks.</li>\n<li>Unable to hold his ground against a committed down block.</li>\n<li>Could have issues getting to rush counters against NFL length.</li>\n</ul>",
            "combineAttendance": true,
            "position": "DT",
            "positionGroup": "DL",
            "verticalJump": {
                "designation": "OFFICIAL",
                "inches": 32.5
            },
            "weight": 282.0
        },
        {
            "id": "ba052617-d981-4dc0-bcc9-16a7e8989c57",
            "year": 2025,
            "person": {
                "id": "32004841-5351-2236-fd73-19b38e23ed86",
                "displayName": "Ahmed Hassanein",
                "esbId": "HAS512236",
                "firstName": "Ahmed",
                "lastName": "Hassanein",
                "hometown": "Cairo, Egypt",
                "collegeNames": [
                    "Boise State"
                ]
            },
            "armLength": 32.25,
            "athleticismScore": 71.35,
            "benchPress": {
                "designation": "OFFICIAL",
                "repetitions": 27
            },
            "broadJump": {
                "designation": "OFFICIAL",
                "inches": 113
            },
            "bio": "<ul><li><strong>2021: </strong>Played in 9 games as a reserve (5 tackles).</li><li><strong>2022:</strong> Played in 12 games with 3 starts (13 tackles, 2 sacks).</li><li><strong>2023:</strong> First-team All-Mountain West Conference. Ranked fifth in the FBS with 12.5 sacks. Started all 14 games (53 tackles, 16.5 TFLs, 2 FFs).</li><li><strong>2024:</strong> First-team All-Mountain West. Tied for the team lead with 15.5 TFLs, led team with 9.5 sacks. Started all 14 games (48 tackles).</li><li><strong>Miscellaneous: </strong>First player from Egypt to play FBS football. Half-brother (same father) Cory Besch, who grew up in America with his mother, played football at Azusa Pacific and is 14 years older than Ahmed.</li></ul>\n<p><em>-- by Chad Reuter</em></p>",
            "collegeClass": "Senior",
            "draftGrade": 66.22,
            "draftProjection": "Round 7",
            "fortyYardDash": {
                "designation": "OFFICIAL",
                "seconds": 4.77
            },
            "grade": 5.69,
            "handSize": 9.0,
            "headshot": "https://static.www.nfl.com/image/private/{formatInstructions}/league/god-prospect-headshots/2023/32004841-5351-2236-fd73-19b38e23ed86",
            "height": 74.375,
            "nflComparison": null,
            "overview": "<p>Bulky 4-3 defensive end with a strong motor and impressive production but a lack of NFL-ready instincts. Hassanein hasn’t played as much football as other prospects, so he’s still in the process of learning technique and developing play recognition. He comes off the ball with a narrow base but will deliver a good initial pop. The rush production is less a function of skilled play and more a function of play extension and secondary effort. He’s tough but limited and misses a lot of tackles.</p>",
            "productionScore": 69.09,
            "profileAuthor": "Lance Zierlein",
            "proFortyYardDash": null,
            "sixtyYardShuttle": null,
            "sizeScore": null,
            "sourcesTellUs": null,
            "strengths": "<ul>\n<li>Racked up 32 tackles for loss, including 22 sacks, over the last two seasons.</li>\n<li>Plays each snap with ideal motor and passion.</li>\n<li>Good knock-back pop when exploding hands into the frame.</li>\n<li>Has feel for quick hand transitions at the junction point as a rusher.</li>\n<li>Gets to and hits the quarterback at a nice clip.</li>\n<li>Keeps feet moving and pads low through his rush.</li>\n</ul>",
            "tenYardSplit": {
                "designation": "UNOFFICIAL",
                "seconds": 1.7
            },
            "threeConeDrill": null,
            "twentyYardShuttle": null,
            "weaknesses": "<ul>\n<li>Tight-hipped and plays with mechanical movements.</li>\n<li>Has trouble controlling and discarding in-line tight ends.</li>\n<li>Too often attacks the blocker and not the play.</li>\n<li>Lacks quality go-to moves for quick wins as a rusher.</li>\n<li>Below-average rush speed and bend on the outside.</li>\n<li>Lack of body control and feel for angles leads to missed tackles.</li>\n</ul>",
            "combineAttendance": true,
            "position": "EDGE",
            "positionGroup": "DL",
            "verticalJump": {
                "designation": "OFFICIAL",
                "inches": 32.5
            },
            "weight": 267.0
        },
        {
            "id": "219ccd51-9856-4420-bd2c-addbd00ffadc",
            "year": 2025,
            "person": {
                "id": "32005749-4c13-4242-9fc2-e1882cb1bc7f",
                "displayName": "Aiden Williams",
                "esbId": "WIL134242",
                "firstName": "Aiden",
                "lastName": "Williams",
                "hometown": "Anchorage, AK",
                "collegeNames": [
                    "Duluth/University of Minnesota"
                ]
            },
            "armLength": null,
            "athleticismScore": null,
            "benchPress": null,
            "broadJump": null,
            "bio": null,
            "collegeClass": "Senior",
            "draftGrade": null,
            "draftProjection": "Round 7/PFA",
            "fortyYardDash": null,
            "grade": 5.69,
            "handSize": null,
            "headshot": "https://static.www.nfl.com/image/private/{formatInstructions}/league/god-draft-headshots/2025/32005749-4c13-4242-9fc2-e1882cb1bc7f",
            "height": 77.0,
            "nflComparison": null,
            "overview": "<p>Sixth-year senior who is likely to transition from tackle to guard due to a lack of length. Williams has a frame that should accept more muscle mass with additional work and he plays with admirable aggression. He has the athletic qualities move-blocking teams look for and can get to play-side/back-side blocks. His hand placement and pad level frequently leave him at a disadvantage leverage-wise, though, and his pass protection is too reactive, leading to frantic recoveries that lack technique. Williams has developmental potential that might warrant a trip to a practice squad for a look.</p>",
            "productionScore": null,
            "profileAuthor": "Lance Zierlein",
            "proFortyYardDash": null,
            "sixtyYardShuttle": null,
            "sizeScore": null,
            "sourcesTellUs": null,
            "strengths": "<ul>\n<li>Needs more mass but possesses a pro-caliber body type.</li>\n<li>Able to gain ground quickly as a lateral blocker off the snap.</li>\n<li>Aggressive into first contact and stays active through the rep.</li>\n<li>Athletic in his lower half to adjust and recover in his pass sets.</li>\n<li>Throws hands into pass rusher with early extension.</li>\n</ul>",
            "tenYardSplit": null,
            "threeConeDrill": null,
            "twentyYardShuttle": null,
            "weaknesses": "<ul>\n<li>Didn’t face size/talent matches across from him during college career.</li>\n<li>Might not have enough anchor to withstand pro power as a guard.</li>\n<li>Will need to improve pad level and/or hand placement for leverage.</li>\n<li>Gets sloppy with footwork and base width in pass protection.</li>\n</ul>",
            "combineAttendance": false,
            "position": "G",
            "positionGroup": "OL",
            "verticalJump": null,
            "weight": 314.0
        },
        {
            "id": "a20cd563-052a-48a3-a836-5c469f2276c7",
            "year": 2025,
            "person": {
                "id": "32004552-5341-5291-e2d1-67b4a003c74d",
                "displayName": "Aireontae Ersery",
                "esbId": "ERS415291",
                "firstName": "Aireontae",
                "lastName": "Ersery",
                "hometown": "Kansas City, MO",
                "collegeNames": [
                    "Minnesota"
                ]
            },
            "armLength": 33.125,
            "athleticismScore": 86.6,
            "benchPress": {
                "designation": "OFFICIAL",
                "repetitions": 25
            },
            "broadJump": {
                "designation": "OFFICIAL",
                "inches": 111
            },
            "bio": "<ul><li><strong>2020:</strong> Played in 1 game as a reserve.</li><li><strong>2021:</strong> Redshirted. Played in 1 game as a reserve.</li><li><strong>2022: </strong>Honorable Mention All-Big Ten Conference. Started all 13 games at LT.</li><li><strong>2023:</strong> Second-team All-Big Ten. Started all 13 games at LT.</li><li><strong>2024: </strong>Third-team Associated Press All-American. Big Ten OL of the Year, first-team All-Big Ten. Started 12 games at LT. Did not play in the team's Duke's Mayo Bowl win over Virginia Tech.</li></ul>\n<p><em>-- by Chad Reuter</em></p>",
            "collegeClass": "Senior",
            "draftGrade": 79.59,
            "draftProjection": "Round 2",
            "fortyYardDash": {
                "designation": "OFFICIAL",
                "seconds": 5.01
            },
            "grade": 6.25,
            "handSize": 9.5,
            "headshot": "https://static.www.nfl.com/image/private/{formatInstructions}/league/god-draft-headshots/2025/32004552-5341-5291-e2d1-67b4a003c74d",
            "height": 78.0,
            "nflComparison": "Marcus Cannon",
            "overview": "<p>Three-year starter at left tackle with good power. Ersery is not a natural bender, which creates disadvantages with leverage and when attempting to mirror moving fronts. He’s well-versed in Minnesota’s outside zone attack, but might be more consistent in power, inside zone and hat-on-hat matchups. He’s huge, but he sets with good quickness to the rush, using his length and hand strength to gather it or lock it out. His anchor is derived from his upper half, which opens him to hand counters. Ersery has the potential to become an average starting tackle on the right side, but his success will be tied to matchups across from him.</p>",
            "productionScore": 74.96,
            "profileAuthor": "Lance Zierlein",
            "proFortyYardDash": null,
            "sixtyYardShuttle": null,
            "sizeScore": null,
            "sourcesTellUs": null,
            "strengths": "<ul>\n<li>Mass of humanity with a broad chest and long arms.</li>\n<li>Good initial slide quickness and depth gain on diagonal sets.</li>\n<li>Fires direct jabs that jolt the rusher and slow his charge.</li>\n<li>Strong, sticky hands keep rusher from escaping once he’s in the web.</li>\n<li>Patient base blocker who typically centers up his initial strike.</li>\n<li>Engages in-line with consistent base width and body control.</li>\n<li>Makes well-timed movements on combo blocks.</li>\n</ul>",
            "tenYardSplit": {
                "designation": "UNOFFICIAL",
                "seconds": 1.75
            },
            "threeConeDrill": {
                "designation": "OFFICIAL",
                "seconds": 7.81
            },
            "twentyYardShuttle": {
                "designation": "OFFICIAL",
                "seconds": 4.82
            },
            "weaknesses": "<ul>\n<li>Plays with limited knee bend and upright posture.</li>\n<li>Target point for pass punch can drift too high on opponent’s frame.</li>\n<li>Tight hips limit his ability to open and recover when beaten.</li>\n<li>Below-average pop on contact in gallop step and down blocks.</li>\n<li>Could struggle getting to lateral landmarks on NFL stretch plays.</li>\n</ul>",
            "combineAttendance": true,
            "position": "OT",
            "positionGroup": "OL",
            "verticalJump": {
                "designation": "OFFICIAL",
                "inches": 29.5
            },
            "weight": 331.0
        },
        {
            "id": "864ef599-e575-46ec-b56d-3e1cfb9b520c",
            "year": 2025,
            "person": {
                "id": "3200434f-5245-7885-59ed-fb1e2c63e751",
                "displayName": "Ajani Cornelius",
                "esbId": "COR457885",
                "firstName": "Ajani",
                "lastName": "Cornelius",
                "hometown": "Harlem, NY",
                "collegeNames": [
                    "Oregon",
                    "Rhode Island"
                ]
            },
            "armLength": 33.5,
            "athleticismScore": 75.94,
            "benchPress": null,
            "broadJump": null,
            "bio": "<ul><li><strong>2020-21 (Rhode Island):</strong> Redshirted. Played in 1 game as a reserve.</li><li><strong>2021 (Rhode Island): </strong>Started all 11 games at RT.</li><li><strong>2022 (Rhode Island):</strong> First-team All-Colonial Athletic Association. Started all 11 games at RT.</li><li><strong>2023:</strong> Honorable Mention All-Pac-12 Conference. Started all 14 games at RT. Team was a Joe Moore Award finalist (nation's top offensive line).</li><li><strong>2024:</strong> Third-team All-Big Ten Conference. Oregon was named a finalist for the Joe Moore Award. Started all 14 games at RT.</li></ul>\n<p><em>-- by Chad Reuter</em></p>",
            "collegeClass": "Senior",
            "draftGrade": 73.36,
            "draftProjection": "Rounds 6-7",
            "fortyYardDash": null,
            "grade": 5.93,
            "handSize": 9.5,
            "headshot": "https://static.www.nfl.com/image/private/{formatInstructions}/league/god-draft-headshots/2025/3200434f-5245-7885-59ed-fb1e2c63e751",
            "height": 76.625,
            "nflComparison": null,
            "overview": "<p>A durable lineman with NFL traits and four years of starting experience, Cornelius lacks standout flashes on tape. He has been a full-time right tackle but lacks protection talent to stay outside as a pro. He has access to physical tools but needs to play with better bend and hand quickness to help stabilize his play. He can cover up defenders with size but is frequently out-leveraged at the point of attack. His average body control and slide quickness should be mitigated in smaller spaces but those issues will still be concerning against explosive interior rushers. The traits should make him a Day 3 target, but his ceiling might be as a backup.</p>",
            "productionScore": 68.54,
            "profileAuthor": "Lance Zierlein",
            "proFortyYardDash": null,
            "sixtyYardShuttle": null,
            "sizeScore": null,
            "sourcesTellUs": null,
            "strengths": "<ul>\n<li>Good heft in lower half with broad waist and long arms.</li>\n<li>Rolls hips into angle blocks and runs his feet.</li>\n<li>Clean skip-pulls to get around the corner as a lead blocker.</li>\n<li>Able to set a late anchor if needed.</li>\n<li>Big hands gain wrist control at the point of attack.</li>\n<li>Long arms can buy him time when the punch is timed well.</li>\n</ul>",
            "tenYardSplit": null,
            "threeConeDrill": null,
            "twentyYardShuttle": null,
            "weaknesses": "<ul>\n<li>Subpar foot quickness and body control in space.</li>\n<li>Tardy with hand strike and beaten to placement.</li>\n<li>Drive power and contact balance sapped by tall pad level.</li>\n<li>Doesn’t play with enough control of hands/feet in protection.</li>\n<li>Gets knocked backward and into the pocket by power.</li>\n<li>Mirror can get pretty raggedy against counters.</li>\n</ul>",
            "combineAttendance": true,
            "position": "OT",
            "positionGroup": "OL",
            "verticalJump": null,
            "weight": 310.0
        },
        {
            "id": "06abbaf8-6021-4761-b438-043dcabcdd7c",
            "year": 2025,
            "person": {
                "id": "3200484f-5702-2703-f062-940c8fdd92a2",
                "displayName": "Alex Howard",
                "esbId": "HOW022703",
                "firstName": "Alex",
                "lastName": "Howard",
                "hometown": "Cincinnati, OH",
                "collegeNames": [
                    "Duke"
                ]
            },
            "armLength": null,
            "athleticismScore": null,
            "benchPress": null,
            "broadJump": null,
            "bio": null,
            "collegeClass": "Senior",
            "draftGrade": null,
            "draftProjection": "Priority free agent",
            "fortyYardDash": null,
            "grade": 5.67,
            "handSize": null,
            "headshot": "https://static.www.nfl.com/image/private/{formatInstructions}/league/god-draft-headshots/2025/3200484f-5702-2703-f062-940c8fdd92a2",
            "height": 73.0,
            "nflComparison": null,
            "overview": "<p>Howard hit the ground running at Duke in 2024 after five years at Youngstown State. He’s a tight-hipped linebacker with adequate pursuit speed but below-average instincts and technique in taking on blocks. His production was bolstered by a gaming front that created opportunities to make impact plays. He’s proven to be solid in man coverage, but he creates very little on-ball production. Howard’s strong 2024 season helps him, but making a team will be a challenge.</p>",
            "productionScore": null,
            "profileAuthor": "Lance Zierlein",
            "proFortyYardDash": null,
            "sixtyYardShuttle": null,
            "sizeScore": null,
            "sourcesTellUs": null,
            "strengths": "<ul>\n<li>Posted 89 tackles, including 14.5 for loss (6.5 sacks), in final season at Duke.</li>\n<li>Spins out of block engagement to become tackle-ready.</li>\n<li>Accelerates and extends to create a wider tackle radius in pursuit.</li>\n<li>Extensive man-cover experience against tight ends and backs.</li>\n<li>Side-step quickness to beat guards/centers as a disruptive blitzer.</li>\n</ul>",
            "tenYardSplit": null,
            "threeConeDrill": null,
            "twentyYardShuttle": null,
            "weaknesses": "<ul>\n<li>Indecisiveness causes him to catch too many climbing blocks.</li>\n<li>Doesn’t use hands effectively enough to stack blockers.</li>\n<li>Below-average feel for play design and run fits.</li>\n<li>Needs to get better at running feet through contact as a tackler.</li>\n</ul>",
            "combineAttendance": false,
            "position": "LB",
            "positionGroup": "LB",
            "verticalJump": null,
            "weight": 228.0
        }
    ]
}