{
    "id": "b9798b6d-0ff0-4e38-a9cb-556173e399a6",
    "year": 2025,
    "person": {
        "id": "3200534d-4901-5660-6d2f-ae20575b8580",
        "displayName": "Aaron Smith",
        "esbId": "SMI015660",
        "firstName": "Aaron",
        "lastName": "Smith",
        "hometown": "Manning, SC",
        "collegeNames": [
            "South Carolina State"
        ]
    },
    "armLength": 31.375,
    "athleticismScore": 83.03,
    "benchPress": {
        "designation": "OFFICIAL",
        "repetitions": 27
    },
    "broadJump": {
        "designation": "OFFICIAL",
        "inches": 109
    },
    "bio": "<ul><li><strong>2022:</strong> Freshman All-American. Third-team All-Big Ten. Finalist for the Shaun Alexander Freshman of the Year Award. Led team with 6.5 sacks. Played in all 13 games with 6 starts (56 tackles, 10.5 TFLs, 4 PBUs).</li><li><strong>2023:</strong> First-team All-Big Ten. Started all 13 games (48 tackles, 5.5 TFLs with 4.5 sacks, INT, 5 PBUs, FF).</li><li><strong>2024: </strong>First-team Associated Press All-American. Big Ten Defensive Player of the Year, DL of the Year. First-team All-Big Ten. Finalist for the Bednarik Award (nation's top defender), Lombardi Award (top OL/DL), Ted Hendricks Award (nation's top DE). Led the FBS with 23.5 TFLs, ranked seventh with 12 sacks. Started all 16 games (68 tackles, 4 PBUs, 2 FFs). Switched from off-ball LB to DE after the departure of Chop Robinson and Adisa Isaac to the NFL.</li></ul>\n<p><em>-- by Chad Reuter</em></p>",
    "collegeClass": "Senior",
    "draftGrade": 90.49,
    "draftProjection": "Priority free agent",
    "fortyYardDash": {
        "designation": "OFFICIAL",
        "seconds": 4.94
    },
    "grade": 5.64,
    "handSize": 9.625,
    "headshot": "https://static.www.nfl.com/image/private/{formatInstructions}/league/god-draft-headshots/2025/3200534d-4901-5660-6d2f-ae20575b8580",
    "height": 72.0,
    "nflComparison": "Darius Philon",
    "overview": "<p>Inside linebacker with solid production and an average athletic profile. Smith looks faster on tape than his timed speed would suggest. He can disrupt the action with called blitzes and shots downhill. However, his instincts and play recognition are lacking. Smith plays with a competitive demeanor, but he needs to ratchet up his physicality as a tackler. He’s capable on special teams, but he might not stand out enough to give himself much of a chance to make a roster.</p>",
    "productionScore": 94.86,
    "profileAuthor": "Lance Zierlein",
    "proFortyYardDash": {
        "designation": "UNOFFICIAL",
        "seconds": 4.5
    },
    "sourcesTellUs": "“He’s a legit specimen. With the right coaching he could end up taking off and becoming the best interior player in this class.” – NFC personnel director",
    "strengths": "<ul>\n<li>Athletic testing showed quality explosiveness in his lower half.</li>\n<li>Slink in his upper body allows him to slip around blocks.</li>\n<li>Scrapes with his eyes and pads square to the action.</li>\n<li>Created duress in the pocket as a pass rusher.</li>\n<li>Has proven himself a productive tackler on kick coverage units.</li>\n</ul>",
    "tenYardSplit": {
        "designation": "UNOFFICIAL",
        "seconds": 1.74
    },
    "threeConeDrill": {
        "designation": "OFFICIAL",
        "seconds": 7.81
    },
    "twentyYardShuttle": {
        "designation": "OFFICIAL",
        "seconds": 4.7
    },
    "weaknesses": "<ul>\n<li>Below-average change of direction quickness.</li>\n<li>Needs to work on block take-ons to leverage his run fits.</li>\n<li>Doesn’t display natural instincts to flow quickly with play design.</li>\n<li>More of a drag-down tackler than a tone-setting striker.</li>\n<li>Will need to prove he has the play speed for faster competition.</li>\n</ul>",
    "combineAttendance": false,
    "position": "LB",
    "positionGroup": "LB",
    "verticalJump": {
        "designation": "OFFICIAL",
        "inches": 32.5
    },
    "weight": 226.0
}